cmsis-svd/cmsis-svd/data/Infineon/s6e2gmxh.svd
        <!-- REGISTER "WFG_WFTF54" -->
        <register>
          <name>WFG_WFTF54</name>
          <description>Pulse Counter Value Register for WFG ch.4/5</description>
          <alternateGroup>WFG</alternateGroup>
          <addressOffset>0x19E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "WFG_WFTA54" -->
        <register>
          <name>WFG_WFTA54</name>
          <description>WFG Timer Value Register for WFG ch.4/5</description>
          <alternateGroup>WFG</alternateGroup>
          <addressOffset>0x1A0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "WFG_WFTB54" -->
        <register>
          <name>WFG_WFTB54</name>
          <description>WFG Timer Value Register for WFG ch.4/5</description>
          <alternateGroup>WFG</alternateGroup>
          <addressOffset>0x1A2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "WFG_WFSA10" -->
        <register>
          <name>WFG_WFSA10</name>
          <description>WFG Control Register A for WFG ch.0/1</description>
          <alternateGroup>WFG</alternateGroup>
          <addressOffset>0x1A4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x3FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DMOD" -->
            <field>
              <name>DMOD</name>
              <description>1specifies polarity for RTO(0) and RTO(1) signal outputs</description>
              <msb>13</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PGEN" -->
            <field>
              <name>PGEN</name>
              <description>specifies how to reflect the CH_PPG signal for each channel of the WFG</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PSEL" -->
            <field>
              <name>PSEL</name>
              <description>select the PPG timer unit to be used for each channel of the WFG</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "GTEN" -->
            <field>
              <name>GTEN</name>
              <description>selects the output conditions for the CH_GATE output signal of the WFG</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TMD" -->
            <field>
              <name>TMD</name>
              <description>select the WFG's operation mode</description>
              <msb>5</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DCK" -->
            <field>
              <name>DCK</name>
              <description>set the count clock cycle for the WFG timer and Pulse counter</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WFG_WFSA32" -->
        <register derivedFrom="WFG_WFSA10">
          <name>WFG_WFSA32</name>
          <description>WFG Control Register A for WFG ch.2/3</description>
          <alternateGroup>WFG</alternateGroup>
          <addressOffset>0x1A8</addressOffset>
        </register>
        <!-- REGISTER "WFG_WFSA54" -->
        <register derivedFrom="WFG_WFSA10">
          <name>WFG_WFSA54</name>
          <description>WFG Control Register A for WFG ch.4/5</description>
          <alternateGroup>WFG</alternateGroup>
          <addressOffset>0x1AC</addressOffset>
        </register>
        <!-- REGISTER "WFG_WFIR" -->
        <register>
          <name>WFG_WFIR</name>
          <description>WFG Interrupt Control Register</description>
          <alternateGroup>WFG</alternateGroup>
          <addressOffset>0x1B0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TMIS54" -->
            <field>
              <name>TMIS54</name>
              <description>stops the WFG54 reload timer and clears TMIF54</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TMIE54" -->
            <field>
              <name>TMIE54</name>
              <description>stops the WFG54 reload timer and clears TMIF54</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TMIC54" -->
            <field>
              <name>TMIC54</name>
              <description>clears TIMF54 bit</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TMIF54" -->
            <field>
              <name>TMIF54</name>
              <description>detects the event of WFG54 reload timer interrupt occurrence</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TMIS32" -->
            <field>
              <name>TMIS32</name>
              <description>stops the WFG32 reload timer and clears TMIF32</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TMIE32" -->
            <field>
              <name>TMIE32</name>
              <description>1stops the WFG32 reload timer and clears TMIF32</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TMIC32" -->
            <field>
              <name>TMIC32</name>
              <description>clears TIMF32 bit</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TMIF32" -->
            <field>
              <name>TMIF32</name>
              <description>detects the event of WFG32 reload timer interrupt occurrence</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TMIS10" -->
            <field>
              <name>TMIS10</name>
              <description>stops the WFG10 reload timer and clears TMIF10</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TMIE10" -->
            <field>
              <name>TMIE10</name>
              <description>starts WFG10 reload timer and checks the operation state of it.</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TMIC10" -->
            <field>
              <name>TMIC10</name>
              <description>clears TIMF10 bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TMIF10" -->
            <field>
              <name>TMIF10</name>
              <description>detects the event of WFG10 reload timer interrupt occurrence</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DTICB" -->
            <field>
              <name>DTICB</name>
              <description>clears DTIFB bit.</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "DTIFB" -->
            <field>
              <name>DTIFB</name>
              <description>detects DTTIX signal input via analog noise filter</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DTICA" -->
            <field>
              <name>DTICA</name>
              <description>clears the DTIFA interrupt flag</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "DTIFA" -->
            <field>
              <name>DTIFA</name>
              <description>detects the event of DTTIX signal input via digital noise-canceller</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WFG_NZCL" -->
        <register>
          <name>WFG_NZCL</name>
          <description>NZCL Control Register</description>
          <alternateGroup>WFG</alternateGroup>
          <addressOffset>0x1B4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x73BF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WIM54" -->
            <field>
              <name>WIM54</name>
              <description>selects whether a WFG54 reload timer interrupt is masked when the WFIR.TMIF54 flag is set</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WIM32" -->
            <field>
              <name>WIM32</name>
              <description>selects whether a WFG32 reload timer interrupt is masked when the WFIR.TMIF32 flag is set</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WIM10" -->
            <field>
              <name>WIM10</name>
              <description>selects whether a WFG10 reload timer interrupt is masked when the WFIR.TMIF10 flag is set</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DIMB" -->
            <field>
              <name>DIMB</name>
              <description>selects whether a DTIF interrupt is masked when the WFIR.TIFDTIFB flag is set</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DIMA" -->
            <field>
              <name>DIMA</name>
              <description>selects whether a DTIF interrupt is masked when the WFIR.DTIFA flag is set</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DHOLD" -->
            <field>
              <name>DHOLD</name>
              <description>selects whether the RTO output signal of WFG is held when the DTIF interrupt signal is asserted</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DTIEB" -->
            <field>
              <name>DTIEB</name>
              <description>Enables the path from DTTIX pin to analog noise filter</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDTI" -->
            <field>
              <name>SDTI</name>
              <description>sets the WFIR.DTIFA register by writing to the register from the CPU</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "NWS" -->
            <field>
              <name>NWS</name>
              <description>set the noise-canceling width for a digital noise-canceller</description>
              <msb>3</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DTIEA" -->
            <field>
              <name>DTIEA</name>
              <description>Enables the path for digital noise filter from DTTIX pin</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ICU_ICFS10" -->
        <register>
          <name>ICU_ICFS10</name>
          <description>ICU ch.0/1 Connecting FRT Select Register</description>
          <alternateGroup>ICU</alternateGroup>
          <addressOffset>0x16C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FSI1" -->
            <field>
              <name>FSI1</name>
              <description>Connects FRT ch.x to ICU ch.(1)</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSI0" -->
            <field>
              <name>FSI0</name>
              <description>Connects FRT ch.x to ICU ch.(0)</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
