cmsis-svd/cmsis-svd/data/Infineon/s6e2gmxh.svd
        <!-- REGISTER "IRQ010SEL" -->
        <register>
          <name>IRQ010SEL</name>
          <description>Relocate Interrupt Selection Register (IRQ010)</description>
          <addressOffset>0x12C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SELBIT15" -->
            <field>
              <name>SELBIT15</name>
              <description>Bit15 of the interrupt source is moved to bit15 of the relocate interrupt.</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT14" -->
            <field>
              <name>SELBIT14</name>
              <description>Bit14 of the interrupt source is moved to bit14 of the relocate interrupt.</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT13" -->
            <field>
              <name>SELBIT13</name>
              <description>Bit13 of the interrupt source is moved to bit13 of the relocate interrupt.</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT12" -->
            <field>
              <name>SELBIT12</name>
              <description>Bit12 of the interrupt source is moved to bit12 of the relocate interrupt.</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT11" -->
            <field>
              <name>SELBIT11</name>
              <description>Bit11 of the interrupt source is moved to bit11 of the relocate interrupt.</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT10" -->
            <field>
              <name>SELBIT10</name>
              <description>Bit10 of the interrupt source is moved to bit10 of the relocate interrupt.</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT9" -->
            <field>
              <name>SELBIT9</name>
              <description>Bit9 of the interrupt source is moved to bit9 of the relocate interrupt.</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT8" -->
            <field>
              <name>SELBIT8</name>
              <description>Bit8 of the interrupt source is moved to bit8 of the relocate interrupt.</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT7" -->
            <field>
              <name>SELBIT7</name>
              <description>Bit7 of the interrupt source is moved to bit7 of the relocate interrupt.</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT6" -->
            <field>
              <name>SELBIT6</name>
              <description>Bit6 of the interrupt source is moved to bit6 of the relocate interrupt.</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT5" -->
            <field>
              <name>SELBIT5</name>
              <description>Bit5 of the interrupt source is moved to bit5 of the relocate interrupt.</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT4" -->
            <field>
              <name>SELBIT4</name>
              <description>Bit4 of the interrupt source is moved to bit4 of the relocate interrupt.</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT3" -->
            <field>
              <name>SELBIT3</name>
              <description>Bit3 of the interrupt source is moved to bit3 of the relocate interrupt.</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT2" -->
            <field>
              <name>SELBIT2</name>
              <description>Bit2 of the interrupt source is moved to bit2 of the relocate interrupt.</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT1" -->
            <field>
              <name>SELBIT1</name>
              <description>Bit1 of the interrupt source is moved to bit1 of the relocate interrupt.</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELBIT0" -->
            <field>
              <name>SELBIT0</name>
              <description>Bit0 of the interrupt source is moved to bit0 of the relocate interrupt.</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SELIRQ" -->
            <field>
              <name>SELIRQ</name>
              <description>specify the IRQ no. of a peripheral interrupt to be relocated</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EXC02MON" -->
        <register>
          <name>EXC02MON</name>
          <description>EXC02 batch read register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HWINT" -->
            <field>
              <name>HWINT</name>
              <description>Interrupt request of the hardware watchdog timer</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NMI" -->
            <field>
              <name>NMI</name>
              <description>Interrupt request of the NMIX external pin</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ000MON" -->
        <register>
          <name>IRQ000MON</name>
          <description>IRQ000 Batch Read Register</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FCSINT" -->
            <field>
              <name>FCSINT</name>
              <description>Interrupt request of the anomalous frequency detected by the CSV</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ001MON" -->
        <register>
          <name>IRQ001MON</name>
          <description>IRQ001 Batch Read Register</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SWWDTINT" -->
            <field>
              <name>SWWDTINT</name>
              <description>interrupt request of the software watchdog timer</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ002MON" -->
        <register>
          <name>IRQ002MON</name>
          <description>IRQ002 Batch Read Register</description>
          <addressOffset>0x20C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LVDINT" -->
            <field>
              <name>LVDINT</name>
              <description>Low-voltage detection (LVD) interrupt request</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
