cmsis-svd/cmsis-svd/data/Infineon/s6e2gmxh.svd
        <!-- REGISTER "I2C_FCR0" -->
        <register>
          <name>I2C_FCR0</name>
          <description>FIFO Control Register 0</description>
          <alternateGroup>I2C</alternateGroup>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FLST" -->
            <field>
              <name>FLST</name>
              <description>FIFO re-transmit data lost flag bit </description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FLD" -->
            <field>
              <name>FLD</name>
              <description>FIFO pointer reload bit </description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSET" -->
            <field>
              <name>FSET</name>
              <description>FIFO pointer save bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FCL2" -->
            <field>
              <name>FCL2</name>
              <description>FIFO2 reset bit </description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FCL1" -->
            <field>
              <name>FCL1</name>
              <description>FIFO1 reset bit </description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FE2" -->
            <field>
              <name>FE2</name>
              <description>FIFO2 operation enable bit </description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FE1" -->
            <field>
              <name>FE1</name>
              <description>FIFO1 operation enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "I2C_FBYTE1" -->
        <register>
          <name>I2C_FBYTE1</name>
          <description>FIFO Byte Register 1</description>
          <alternateGroup>I2C</alternateGroup>
          <addressOffset>0x18</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "I2C_FBYTE2" -->
        <register>
          <name>I2C_FBYTE2</name>
          <description>FIFO Byte Register 2</description>
          <alternateGroup>I2C</alternateGroup>
          <addressOffset>0x19</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "I2C_NFCR" -->
        <register>
          <name>I2C_NFCR</name>
          <description>Noise Filter Control Register</description>
          <alternateGroup>I2C</alternateGroup>
          <addressOffset>0x1C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "NFT" -->
            <field>
              <name>NFT</name>
              <description>Noise Filter Time Select bits</description>
              <msb>4</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "I2C_EIBCR" -->
        <register>
          <name>I2C_EIBCR</name>
          <description>Extension I2C Bus Control Register</description>
          <alternateGroup>I2C</alternateGroup>
          <addressOffset>0x1D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0C</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SDAS" -->
            <field>
              <name>SDAS</name>
              <description>SDA status bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SCLS" -->
            <field>
              <name>SCLS</name>
              <description>SCL status bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SDAC" -->
            <field>
              <name>SDAC</name>
              <description>SDA output control bit </description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCLC" -->
            <field>
              <name>SCLC</name>
              <description>SCL output control bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOCE" -->
            <field>
              <name>SOCE</name>
              <description>Serial output enabled bit </description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BEC" -->
            <field>
              <name>BEC</name>
              <description>Bus error control bit </description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
