cmsis-svd/cmsis-svd/data/Infineon/s6e2gmxh.svd
        <!-- REGISTER "IF2DTB_L" -->
        <register>
          <name>IF2DTB_L</name>
          <description>IF2 Data Registers B</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DATA7" -->
            <field>
              <name>DATA7</name>
              <description>Data(7) Little Endian</description>
              <msb>31</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA6" -->
            <field>
              <name>DATA6</name>
              <description>Data(6) Little Endian</description>
              <msb>23</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA5" -->
            <field>
              <name>DATA5</name>
              <description>Data(5) Little Endian</description>
              <msb>15</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA4" -->
            <field>
              <name>DATA4</name>
              <description>Data(4) Little Endian</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF2DTA_B" -->
        <register>
          <name>IF2DTA_B</name>
          <description>IF2 Data Registers A</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DATA0" -->
            <field>
              <name>DATA0</name>
              <description>Data(0) Big Endian</description>
              <msb>31</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA1" -->
            <field>
              <name>DATA1</name>
              <description>Data(1) Big Endian</description>
              <msb>23</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA2" -->
            <field>
              <name>DATA2</name>
              <description>Data(2) Big Endian</description>
              <msb>15</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA3" -->
            <field>
              <name>DATA3</name>
              <description>Data(3) Big Endian</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IF2DTB_B" -->
        <register>
          <name>IF2DTB_B</name>
          <description>IF2 Data Registers B</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DATA4" -->
            <field>
              <name>DATA4</name>
              <description>Data(4) Big Endian</description>
              <msb>31</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA5" -->
            <field>
              <name>DATA5</name>
              <description>Data(5) Big Endian</description>
              <msb>23</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA6" -->
            <field>
              <name>DATA6</name>
              <description>Data(6) Big Endian</description>
              <msb>15</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DATA7" -->
            <field>
              <name>DATA7</name>
              <description>Data(7) Big Endian</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TREQR" -->
        <register>
          <name>TREQR</name>
          <description>CAN Transmit Request Registers</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TXRQST32" -->
            <field>
              <name>TXRQST32</name>
              <description>Bit31 of TREQR</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXRQST31" -->
            <field>
              <name>TXRQST31</name>
              <description>Bit30 of TREQR</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXRQST30" -->
            <field>
              <name>TXRQST30</name>
              <description>Bit29 of TREQR</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXRQST29" -->
            <field>
              <name>TXRQST29</name>
              <description>Bit28 of TREQR</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXRQST28" -->
            <field>
              <name>TXRQST28</name>
              <description>Bit27 of TREQR</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXRQST27" -->
            <field>
              <name>TXRQST27</name>
              <description>Bit26 of TREQR</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXRQST26" -->
            <field>
              <name>TXRQST26</name>
              <description>Bit25 of TREQR</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXRQST25" -->
            <field>
              <name>TXRQST25</name>
              <description>Bit24 of TREQR</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXRQST24" -->
            <field>
              <name>TXRQST24</name>
              <description>Bit23 of TREQR</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXRQST23" -->
            <field>
              <name>TXRQST23</name>
              <description>Bit22 of TREQR</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXRQST22" -->
            <field>
              <name>TXRQST22</name>
              <description>Bit21 of TREQR</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXRQST21" -->
            <field>
              <name>TXRQST21</name>
              <description>Bit20 of TREQR</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXRQST20" -->
            <field>
              <name>TXRQST20</name>
              <description>Bit19 of TREQR</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXRQST19" -->
            <field>
              <name>TXRQST19</name>
              <description>Bit18 of TREQR</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXRQST18" -->
            <field>
              <name>TXRQST18</name>
              <description>Bit17 of TREQR</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXRQST17" -->
            <field>
              <name>TXRQST17</name>
              <description>Bit16 of TREQR</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXRQST16" -->
            <field>
              <name>TXRQST16</name>
              <description>Bit15 of TREQR</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXRQST15" -->
            <field>
              <name>TXRQST15</name>
              <description>Bit14 of TREQR</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXRQST14" -->
            <field>
              <name>TXRQST14</name>
              <description>Bit13 of TREQR</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXRQST13" -->
            <field>
              <name>TXRQST13</name>
              <description>Bit12 of TREQR</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXRQST12" -->
            <field>
              <name>TXRQST12</name>
              <description>Bit11 of TREQR</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXRQST11" -->
            <field>
              <name>TXRQST11</name>
              <description>Bit10 of TREQR</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXRQST10" -->
            <field>
              <name>TXRQST10</name>
              <description>Bit9 of TREQR</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXRQST9" -->
            <field>
              <name>TXRQST9</name>
              <description>Bit8 of TREQR</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXRQST8" -->
            <field>
              <name>TXRQST8</name>
              <description>Bit7 of TREQR</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXRQST7" -->
            <field>
              <name>TXRQST7</name>
              <description>Bit6 of TREQR</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXRQST6" -->
            <field>
              <name>TXRQST6</name>
              <description>Bit5 of TREQR</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXRQST5" -->
            <field>
              <name>TXRQST5</name>
              <description>Bit4 of TREQR</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXRQST4" -->
            <field>
              <name>TXRQST4</name>
              <description>Bit3 of TREQR</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXRQST3" -->
            <field>
              <name>TXRQST3</name>
              <description>Bit2 of TREQR</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXRQST2" -->
            <field>
              <name>TXRQST2</name>
              <description>Bit1 of TREQR</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXRQST1" -->
            <field>
              <name>TXRQST1</name>
              <description>Bit0 of TREQR</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "NEWDT" -->
        <register>
          <name>NEWDT</name>
          <description>CAN New Data Registers</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "NEWDAT32" -->
            <field>
              <name>NEWDAT32</name>
              <description>Bit31 of NEWDT</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT31" -->
            <field>
              <name>NEWDAT31</name>
              <description>Bit30 of NEWDT</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT30" -->
            <field>
              <name>NEWDAT30</name>
              <description>Bit29 of NEWDT</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT29" -->
            <field>
              <name>NEWDAT29</name>
              <description>Bit28 of NEWDT</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT28" -->
            <field>
              <name>NEWDAT28</name>
              <description>Bit27 of NEWDT</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT27" -->
            <field>
              <name>NEWDAT27</name>
              <description>Bit26 of NEWDT</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT26" -->
            <field>
              <name>NEWDAT26</name>
              <description>Bit25 of NEWDT</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT25" -->
            <field>
              <name>NEWDAT25</name>
              <description>Bit24 of NEWDT</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT24" -->
            <field>
              <name>NEWDAT24</name>
              <description>Bit23 of NEWDT</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT23" -->
            <field>
              <name>NEWDAT23</name>
              <description>Bit22 of NEWDT</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT22" -->
            <field>
              <name>NEWDAT22</name>
              <description>Bit21 of NEWDT</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT21" -->
            <field>
              <name>NEWDAT21</name>
              <description>Bit20 of NEWDT</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT20" -->
            <field>
              <name>NEWDAT20</name>
              <description>Bit19 of NEWDT</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT19" -->
            <field>
              <name>NEWDAT19</name>
              <description>Bit18 of NEWDT</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT18" -->
            <field>
              <name>NEWDAT18</name>
              <description>Bit17 of NEWDT</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT17" -->
            <field>
              <name>NEWDAT17</name>
              <description>Bit16 of NEWDT</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT16" -->
            <field>
              <name>NEWDAT16</name>
              <description>Bit15 of NEWDT</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT15" -->
            <field>
              <name>NEWDAT15</name>
              <description>Bit14 of NEWDT</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT14" -->
            <field>
              <name>NEWDAT14</name>
              <description>Bit13 of NEWDT</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT13" -->
            <field>
              <name>NEWDAT13</name>
              <description>Bit12 of NEWDT</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT12" -->
            <field>
              <name>NEWDAT12</name>
              <description>Bit11 of NEWDT</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT11" -->
            <field>
              <name>NEWDAT11</name>
              <description>Bit10 of NEWDT</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT10" -->
            <field>
              <name>NEWDAT10</name>
              <description>Bit9 of NEWDT</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT9" -->
            <field>
              <name>NEWDAT9</name>
              <description>Bit8 of NEWDT</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT8" -->
            <field>
              <name>NEWDAT8</name>
              <description>Bit7 of NEWDT</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT7" -->
            <field>
              <name>NEWDAT7</name>
              <description>Bit6 of NEWDT</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT6" -->
            <field>
              <name>NEWDAT6</name>
              <description>Bit5 of NEWDT</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT5" -->
            <field>
              <name>NEWDAT5</name>
              <description>Bit4 of NEWDT</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT4" -->
            <field>
              <name>NEWDAT4</name>
              <description>Bit3 of NEWDT</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT3" -->
            <field>
              <name>NEWDAT3</name>
              <description>Bit2 of NEWDT</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT2" -->
            <field>
              <name>NEWDAT2</name>
              <description>Bit1 of NEWDT</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT1" -->
            <field>
              <name>NEWDAT1</name>
              <description>Bit0 of NEWDT</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
