cmsis-svd/cmsis-svd/data/Infineon/s6e2gmxh.svd
        <!-- REGISTER "STNR" -->
        <register>
          <name>STNR</name>
          <description>System Time - Nanoseconds Register</description>
          <addressOffset>0x70C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7FFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TSSS" -->
            <field>
              <name>TSSS</name>
              <description>Time Stamp Sub-Seconds</description>
              <msb>30</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "STSUR" -->
        <register>
          <name>STSUR</name>
          <description>System Time - Seconds Update Register</description>
          <addressOffset>0x710</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TSS" -->
            <field>
              <name>TSS</name>
              <description>Time Stamp Second</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "STNUR" -->
        <register>
          <name>STNUR</name>
          <description>System Time - Nanoseconds Update Register</description>
          <addressOffset>0x714</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ADDSUB" -->
            <field>
              <name>ADDSUB</name>
              <description>Add or Subtract Time</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSSS" -->
            <field>
              <name>TSSS</name>
              <description>Time Stamp Sub-Seconds</description>
              <msb>30</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TSAR" -->
        <register>
          <name>TSAR</name>
          <description>Time Stamp Addend Register</description>
          <addressOffset>0x718</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TSAR" -->
            <field>
              <name>TSAR</name>
              <description>Time Stamp Addend Register</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TTSR" -->
        <register>
          <name>TTSR</name>
          <description>Target Time Seconds Register</description>
          <addressOffset>0x71C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TSTR" -->
            <field>
              <name>TSTR</name>
              <description>Target Time Stamp Seconds Register</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TTNR" -->
        <register>
          <name>TTNR</name>
          <description>Target Time Nanoseconds Register</description>
          <addressOffset>0x720</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7FFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TSTR" -->
            <field>
              <name>TSTR</name>
              <description>Target Time Stamp Nanoseconds Register</description>
              <msb>30</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "STHWSR" -->
        <register>
          <name>STHWSR</name>
          <description>System Time - Higher Word Seconds Register</description>
          <addressOffset>0x724</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TSHWR" -->
            <field>
              <name>TSHWR</name>
              <description>Time Stamp Higher Word Register</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TSR" -->
        <register>
          <name>TSR</name>
          <description>Time Stamp Status Register</description>
          <addressOffset>0x728</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0F00000F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ATSNS" -->
            <field>
              <name>ATSNS</name>
              <description>Auxiliary Time Stamp Number of Snapshots</description>
              <msb>27</msb>
              <lsb>25</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ATSSTM" -->
            <field>
              <name>ATSSTM</name>
              <description>Auxiliary Time Stamp Snapshot Trigger Missed</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRGTER" -->
            <field>
              <name>TRGTER</name>
              <description>Timestamp Target Time Error</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ATSTS" -->
            <field>
              <name>ATSTS</name>
              <description>Auxiliary Time Stamp Trigger Snapshot</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TSTART" -->
            <field>
              <name>TSTART</name>
              <description>Time Stamp Target Time Reached</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TSSOVF" -->
            <field>
              <name>TSSOVF</name>
              <description>Time Stamp Seconds Overflow</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PPSCR" -->
        <register>
          <name>PPSCR</name>
          <description>PPS Control Register</description>
          <addressOffset>0x72C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PPSCTRL" -->
            <field>
              <name>PPSCTRL</name>
              <description>Controls the frequency of the PPS output</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ATNR" -->
        <register>
          <name>ATNR</name>
          <description>Auxiliary Time Stamp - Nanoseconds Register</description>
          <addressOffset>0x730</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7FFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ATN" -->
            <field>
              <name>ATN</name>
              <description>ATN</description>
              <msb>30</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ATSR" -->
        <register>
          <name>ATSR</name>
          <description>Auxiliary Time Stamp - Seconds Register</description>
          <addressOffset>0x734</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ATS" -->
            <field>
              <name>ATS</name>
              <description>ATS</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MAR16H" -->
        <register derivedFrom="MAR1H">
          <name>MAR16H</name>
          <description>MAC Address16 Register -High</description>
          <addressOffset>0x800</addressOffset>
        </register>
        <!-- REGISTER "MAR16L" -->
        <register derivedFrom="MAR1L">
          <name>MAR16L</name>
          <description>MAC Address16 Register -Low</description>
          <addressOffset>0x804</addressOffset>
        </register>
        <!-- REGISTER "MAR17H" -->
        <register derivedFrom="MAR1H">
          <name>MAR17H</name>
          <description>MAC Address17 Register -High</description>
          <addressOffset>0x808</addressOffset>
        </register>
        <!-- REGISTER "MAR17L" -->
        <register derivedFrom="MAR1L">
          <name>MAR17L</name>
          <description>MAC Address17 Register -Low</description>
          <addressOffset>0x80C</addressOffset>
        </register>
