cmsis-svd/cmsis-svd/data/Infineon/s6e2gmxh.svd
        <!-- REGISTER "STUNSTL" -->
        <register>
          <name>STUNSTL</name>
          <description>Tuning Status Register L</description>
          <addressOffset>0x10C</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x07FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "REP3TNRSLT" -->
            <field>
              <name>REP3TNRSLT</name>
              <description>3 Phase Re-Tuning Result</description>
              <msb>10</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "REP8TNRSLT" -->
            <field>
              <name>REP8TNRSLT</name>
              <description>8 Phase Tuning / Re-Tuning Result</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "STUNSTH" -->
        <register>
          <name>STUNSTH</name>
          <description>Tuning Status Register H</description>
          <addressOffset>0x10E</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PRSTTNPNT" -->
            <field>
              <name>PRSTTNPNT</name>
              <description>Present Tuning point</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PSWISTL" -->
        <register>
          <name>PSWISTL</name>
          <description>Power Switching Interrupt Status Register L</description>
          <addressOffset>0x118</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT1MS" -->
            <field>
              <name>INT1MS</name>
              <description>1ms Wait Interrupt</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT5MS" -->
            <field>
              <name>INT5MS</name>
              <description>5ms Wait Interrupt</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PSWISTH" -->
        <register>
          <name>PSWISTH</name>
          <description>Power Switching Interrupt Status Register H</description>
          <addressOffset>0x11A</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0000</resetMask>
        </register>
        <!-- REGISTER "PSWISTEL" -->
        <register>
          <name>PSWISTEL</name>
          <description>Power Switching Interrupt Status Enable Register L</description>
          <addressOffset>0x11C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT1MSSTS" -->
            <field>
              <name>INT1MSSTS</name>
              <description>1ms Wait Interrupt Status Enable</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INT5MSSTS" -->
            <field>
              <name>INT5MSSTS</name>
              <description>5ms Wait Interrupt Status Enable</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PSWISTEH" -->
        <register>
          <name>PSWISTEH</name>
          <description>Power Switching Interrupt Status Enable Register H</description>
          <addressOffset>0x11E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0000</resetMask>
        </register>
        <!-- REGISTER "PSWISGEL" -->
        <register>
          <name>PSWISGEL</name>
          <description>Power Switching Interrupt Signal Enable Register L</description>
          <addressOffset>0x120</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT1MSSGEN" -->
            <field>
              <name>INT1MSSGEN</name>
              <description>1ms Wait Interrupt Signal Enable</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INT5MSSGEN" -->
            <field>
              <name>INT5MSSGEN</name>
              <description>5ms Wait Interrupt Signal Enable</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PSWISGEH" -->
        <register>
          <name>PSWISGEH</name>
          <description>Power Switching Interrupt Signal Enable Register H</description>
          <addressOffset>0x122</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0000</resetMask>
        </register>
        <!-- REGISTER "MMCSDCL" -->
        <register>
          <name>MMCSDCL</name>
          <description>MMC/eSD Control Register L</description>
          <addressOffset>0x124</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x030F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CMDDATDLY" -->
            <field>
              <name>CMDDATDLY</name>
              <description>CMD / DAT Delay Select</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MMCDDRSEL" -->
            <field>
              <name>MMCDDRSEL</name>
              <description>MMC DDR Select</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VCCQCTLMMC" -->
            <field>
              <name>VCCQCTLMMC</name>
              <description>VCCQ Control for MMC</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VCCCTLMMC" -->
            <field>
              <name>VCCCTLMMC</name>
              <description>VCC Control for MMC</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RSTMMC" -->
            <field>
              <name>RSTMMC</name>
              <description>RST_n Control for MMC</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LCKRSTESD" -->
            <field>
              <name>LCKRSTESD</name>
              <description>Lock-Reset Control for MMC</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MMCSDCH" -->
        <register>
          <name>MMCSDCH</name>
          <description>MMC/eSD Control Register H</description>
          <addressOffset>0x126</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BTMDENMMC" -->
            <field>
              <name>BTMDENMMC</name>
              <description>Boot Mode Enable for MMC</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BTABTENMMC" -->
            <field>
              <name>BTABTENMMC</name>
              <description>Boot Auto Abort Enable for MMC</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BTACKENMMC" -->
            <field>
              <name>BTACKENMMC</name>
              <description>Boot Ack Enable for MMC</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MCWIRQC0" -->
        <register>
          <name>MCWIRQC0</name>
          <description>MMC Wait IRQ Control Register 0</description>
          <addressOffset>0x128</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTIRQST" -->
            <field>
              <name>WTIRQST</name>
              <description>Wait IRQ State</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WTIRQEN" -->
            <field>
              <name>WTIRQEN</name>
              <description>Wait IRQ Enable</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MCWIRQC1" -->
        <register>
          <name>MCWIRQC1</name>
          <description>MMC Wait IRQ Control Register 1</description>
          <addressOffset>0x12A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTIRQCNCLR" -->
            <field>
              <name>WTIRQCNCLR</name>
              <description>Wait IRQ Cancel Response</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MCWIRQC2" -->
        <register>
          <name>MCWIRQC2</name>
          <description>MMC Wait IRQ Control Register 2</description>
          <addressOffset>0x12C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTIRQCNCLR" -->
            <field>
              <name>WTIRQCNCLR</name>
              <description>Wait IRQ Cancel Response</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
